Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: In Git, however, every developer is potentially both a node and a hub — that is, every developer can both contribute code to other repositories and maintain a public repository on which others can base their work and which they can contribute to.
cs: Naproti tomu je v systému Git každý vývojář potenciálním uzlem i úložištěm, každý vývojář může přispívat kódem do jiných repozitářů i spravovat veřejný repozitář, na němž mohou ostatní založit svou práci a do nějž mohou přispívat.

source: In Git, there are two main ways to integrate changes from one branch into another: the `merge` and the `rebase`.
cs: V systému Git existují dvě základní možnosti, jak integrovat změny z jedné větve do druhé: sloučení (neboli začlenění) příkazem `merge` a přeskládání příkazem `rebase`.

source: In Git, these are called "references" or "refs"; you can find the files that contain the SHA-1 values in the `.git/refs` directory.
cs: V systému Git se těmto ukazatelům říká reference (angl. „references“ nebo „refs“). Soubory, které obsahují hodnoty SHA-1, najdete v adresáři `.git/refs`.

source: In Git, this is a pointer to the local branch you’re currently on.
cs: V systému Git se jedná o ukazatel na lokální větev, na níž se právě nacházíte.

source: In Git, this is called _rebasing_.
cs: V systému Git se tato metoda nazývá _přeskládání_ (rebasing).

source: In Git, you can use the attributes functionality to effectively diff binary files.
cs: V systému Git můžete zadáním vhodných parametrů efektivně porovnávat binární soubory.

source: In Perforce, for example, you can’t do much when you aren’t connected to the server; and in Subversion and CVS, you can edit files, but you can’t commit changes to your database (because your database is offline).
cs: Například v systému Perforce toho lze bez připojení k serveru dělat jen velmi málo, v systémech Subversion a CVS můžete sice upravovat soubory, ale nemůžete zapisovat změny do databáze (neboť ta je offline).

source: In Ruby, you can use the `FileUtils.mkdir_p()` function to create the subdirectory if it doesn’t exist.
cs: Pokud podadresář neexistuje, můžete ho v jazyce Ruby vytvořit pomocí funkce `FileUtils.mkdir_p()`.

source: In Subversion, each person committing has a user on the system who is recorded in the commit information.
cs: V Subversion má každá osoba zapisující revize v systému přiděleného uživatele, který je u zaznamenán informací o revizi.

source: In Table 2-3 we’ll list these and a few other common options for your reference.
cs: Tabulka 2-3 uvádí pro přehlednost zmíněné parametry a několik málo dalších.

source: In `git svn`, it looks like this:
cs: V nástroji `git svn` to bude vypadat následovně:

source: In a DVCS (such as Git, Mercurial, Bazaar or Darcs), clients don’t just check out the latest snapshot of the files: they fully mirror the repository.
cs: V systémech DVCS (jako jsou například Git, Mercurial, Bazaar nebo Darcs) uživatelé nestahují pouze nejnovější verzi souborů (tzv. snímek, anglicky snapshot), ale uchovávají kompletní kopii repozitáře (repository).

source: In a corporate environment, however, unauthenticated access is a no-no, and a developer workstation cannot do authentication, so you have to push to the central server and ask someone to pull from there.
cs: V korporátním prostředí ovšem nebývá jakýkoliv přístup bez prokázání totožnosti vítán a pracovní stanice vývojáře nemůže provádět autentizaci, takže můžete na centrální server odesílat, ale musíte požádat někoho jiného, když odtud chcete stahovat.

source: In addition to knowing how to effectively contribute to a project, you’ll likely need to know how to maintain one.
cs: Při práci na projektech Git možná nevystačíte jen s vědomostmi, jak do projektu efektivně přispívat. Pravděpodobně budete jednou potřebovat vědět něco i o správě projektů.

source: In addition to output-formatting options, `git log` takes a number of useful limiting options — that is, options that let you show only a subset of commits.
cs: Kromě parametrů k formátování výstupu lze pro `git log` použít také celou řadu omezujících parametrů, tj. takových, které zobrazí jen definovanou podmnožinu revizí.

source: In addition to restricting what branches a user can push changes to, you can also restrict what files they are allowed to touch.
cs: K omezení odesílání do určitých větví a určitými uživateli můžete přidat také omezení určující, které soubory mohou uživatelé měnit.

source: In addition to the client-side hooks, you can use a couple of important server-side hooks as a system administrator to enforce nearly any kind of policy for your project.
cs: Vedle zásuvných modulů na straně klienta můžete jako správce systému využívat také několik důležitých zásuvných modulů na straně serveru, které vám pomohou kontrolovat téměř jakýkoli typ standardů stanovených pro daný projekt.

source: In addition, each of these has subsettings you can use to set specific colors for parts of the output, if you want to override each color.
cs: Chcete-li sami nastavit jednotlivé barvy, mají všechny tyto parametry navíc dílčí nastavení, které můžete použít k určení konkrétních barev pro jednotlivé části výstupu.

source: In addition, it sends back the HEAD reference so the client knows what to check out if this is a clone.
cs: Kromě toho pošle proces zpět referenci HEAD, aby klient v případě, že se jedná o klonování, věděl, kam přepnout.

source: In addition, the `short`, `full`, and `fuller` options show the output in roughly the same format but with less or more information, respectively:
cs: Dále se nabízejí parametry `short`, `full` a `fuller` (zkrácený, plný, úplný). Zobrazují výstup přibližně ve stejném formátu, avšak s více či méně podrobnými informacemi:

source: In addition, you get all this for very little overhead.
cs: Všechny funkcionality verzovacího systému můžete navíc používat velice jednoduchým způsobem.

source: In any case, the Git protocol is relatively easy to set up.
cs: Ať tak či tak, na protokolu Git jistě oceníte jeho snadné nastavení.

source: In any case, you can change e-mail addresses in multiple commits in a batch with `filter-branch` as well.
cs: V obou těchto případech můžete změnit e-mailové adresy v několika revizích hromadně příkazem `filter-branch`.

source: In centralized systems, every developer is a node working more or less equally on a central hub.
cs: V centralizovaných systémech představuje každý vývojář samostatný uzel, pracující více či méně na stejné úrovni vůči centrálnímu úložišti.

source: In centralized systems, there is generally a single collaboration model—the centralized workflow.
cs: V centralizovaných systémech je většinou možný pouze jediný model spolupráce, tzv. centralizovaný pracovní postup.

source: In either case, after `fetch-pack` connects, `upload-pack` sends back something like this:
cs: V obou případech zašle po připojení procesu `fetch-pack` proces `upload-pack` zpět následující informace:

source: In essence, you want to treat it like a binary file.
cs: Z těchto důvodů s ním budete chtít zacházet jako s binárním souborem.

source: In fact, Git stores everything not by file name but in the Git database addressable by the hash value of its contents.
cs: Git nic neukládá podle názvu souboru. Místo toho používá databázi adresovatelnou hodnotou otisku, který odpovídá obsahu souboru.

source: In fact, if you build Git from source code cloned from the Git repository, `git --version` gives you something that looks like this.
cs: Pokud sestavujete Git ze zdrojového kódu naklonovaného z repozitáře Git, získáte po spuštění příkazu `git --version` něco, co vypadá zhruba podobně.

source: In fact, if you have a script that will exit 0 if the project is good or non-0 if the project is bad, you can fully automate `git bisect`.
cs: A máte-li skript, který bude pro správně fungující projekt vracet hodnotu 0 (nula), nebo nenulovou hodnotu, pokud je v projektu chyba, můžete příkaz `git bisect` dokonce plně automatizovat.

source: In fact, if you run something like this and look at the status, you’ll see that Git considers it a renamed file:
cs: A skutečně, pokud takový příkaz provedete a podíváte se na stav souboru, uvidíte, že ho Git považuje za přejmenovaný (renamed):

source: In fact, if your server disk gets corrupted, you can use any of the clones on any client to set the server back to the state it was in when it was cloned (you may lose some server-side hooks and such, but all the versioned data would be there — see _Chapter 4_ for more details).
cs: Pokud by někdy poté došlo k poruše disku serveru, lze použít libovolný z těchto klonů na kterémkoli klientovi a obnovit pomocí něj server zpět do stavu, v němž byl v okamžiku klonování (může dojít ke ztrátě některých zásuvných modulů na straně serveru a podobných věcí, ale všechna verzovaná data budou obnovena. Další podrobnosti naleznete v _kapitole 4_.

source: In fact, we used GitHub to privately collaborate on this book.
cs: Možnost soukromého použití GitHub jsme ostatně používali pro spolupráci při vzniku této knihy.

source: In fact, you can do `-<n>`, where `n` is any integer to show the last `n` commits.
cs: Obecně lze tedy říci, že můžete zadat parametr `-<n>`, kde `n` je libovolné celé číslo pro zobrazení posledních `n` revizí.

source: In many VCS tools, this is a somewhat expensive process, often requiring you to create a new copy of your source code directory, which can take a long time for large projects.
cs: V mnoha VCS nástrojích se může jednat o poněkud náročný proces, který často vyžaduje vytvoření nové kopie adresáře se zdrojovým kódem. To může – zvláště u velkých projektů – trvat poměrně dlouho.

source: In many instances, you’ll have two or three developers with a few commits a day, or possibly less for somewhat dormant projects.
cs: V mnoha případech budete mít dva nebo tři vývojáře přispívající několika málo revizemi denně, u projektů s nízkou prioritou možná i méně.

source: In many other systems, doing so is either impossible or painful.
cs: V mnoha jiných systémech je takový postup nemožný nebo přinejmenším obtížný.

source: In more complex cases, the client supports `multi_ack` or `side-band` capabilities; but this example shows you the basic back and forth used by the smart protocol processes.
cs: Ve složitějších případech podporuje klient schopnosti `multi_ack` nebo `side-band`. Uvedený příklad ale dobře ilustruje základní komunikaci tam a zpět, jak ji používají procesy chytrých protokolů.

source: In most projects, that’s `.git/hooks`.
cs: U většiny projektů to bude konkrétně `.git/hooks`.

source: In most scenarios, if you want color codes in your redirected output, you can instead pass a `--color` flag to the Git command to force it to use color codes.
cs: Chcete-li použít barevné kódy v přesměrovaném výstupu, můžete většinou místo toho přidat k příkazu Git příznak `--color`. Po jeho zadání příkaz použije barevné kódy.

source: In newer versions of Git (beginning with version 1.6.1), you can set `receive.denyDeletes` to true:
cs: V novějších verzích systému Git (počínaje verzí 1.6.1) lze nastavit možnost `receive.denyDeletes` na hodnotu true:

source: In order for a repository to be served over the Git protocol, you must create the `git-daemon-export-ok` file — the daemon won’t serve a repository without that file in it — but other than that there is no security.
cs: Chcete-li, aby byl repozitář zpřístupněn protokolem Git, musíte vytvořit soubor `git-daemon-export-ok`. Bez tohoto souboru nebude repozitář démonem zpřístupněn. Žádné jiné zabezpečení ale k dispozici není.

source: In order to begin tracking a new file, you use the command `git add`.
cs: K zahájení sledování nových souborů se používá příkaz `git add`.

source: In order to clone your repository to create a new bare repository, you run the clone command with the `--bare` option.
cs: Chcete-li naklonovat stávající repozitář, a vytvořit tak nový a holý, zadejte příkaz pro klonování s parametrem `--bare`.

source: In order to do that easily, you can use a tool called `svnsync` that comes with more recent versions of Subversion — it should be distributed with at least 1.4.
cs: Snadno ho zkopírujete pomocí nástroje `svnsync`, jenž je součástí novějších verzí systému Subversion – měl by být distribuován s verzí 1.4 a vyšší.

source: In order to do that, you’ll merge in your `iss53` branch, much like you merged in your `hotfix` branch earlier.
cs: Učiníte tak začleněním větve `iss53`, které bude probíhat velmi podobně jako předchozí začlenění větve `hotfix`.

source: In order to import a Git directory, you need to review how Git stores its data.
cs: Chcete-li importovat adresář Git, budeme se muset podívat na to, jak Git ukládá svá data.

source: In order to initially set up any Git server, you have to export an existing repository into a new bare repository — a repository that doesn’t contain a working directory.
cs: Pro úvodní nastavení serveru Git je třeba exportovat existující repozitář do nového, holého repozitáře (bare repository), tj. do repozitáře, který neobsahuje pracovní adresář.

source: In order to provide a public key, each user in your system must generate one if they don’t already have one.
cs: Aby vám mohli všichni uživatelé ve vašem systému poskytnout veřejný klíč, musí si ho každý z nich nechat vygenerovat (pokud klíč ještě nemá).

source: In order to resolve the conflict, you have to either choose one side or the other or merge the contents yourself.
cs: Chcete-li vzniklý konflikt vyřešit, musíte buď vybrat jednu z obou stran, nebo konflikt sloučit sami.

source: In other words, in this case, you don’t have a new `serverfix` branch — you only have an `origin/serverfix` pointer that you can’t modify.
cs: Jinak řečeno: v tomto případě nebudete mít novou větev `serverfix`, budete mít pouze ukazatel `origin/serverfix`, který nemůžete měnit.

source: In other words, use commands.
cs: Jinými slovy, formulujte je jako příkazy.

source: In other words, you may want to keep the file on your hard drive but not have Git track it anymore.
cs: Soubor tak ponecháte na svém pevném disku, ale ukončíte jeho sledování systémem Git.

source: In reality, we’re talking about pointers moving up the line of commits you’re making.
cs: Ve skutečnosti hovoříme o ukazatelích pohybujících se vzhůru po linii revizí, které zapisujete.

source: In reality, you’re unlikely to use that often, because Git by default pipes all output through a pager so you see only one page of log output at a time.
cs: Je však třeba dodat, že tuto funkci asi nebudete využívat příliš často. Git totiž standardně redukuje všechny výpisy stránkovačem, a proto se vždy najednou zobrazí pouze jedna stránka logu.

source: In some contexts, the first line is treated as the subject of an email and the rest of the text as the body.
cs: V některých kontextech je první řádek koncipován jako předmět e-mailu a zbytek textu jako jeho tělo.

source: In some use case scenarios you might want to apply stashed changes, do some work, but then un-apply those changes that originally came from the stash.
cs: V některých případech můžete chtít aplikovat odložené změny, udělat nějakou práci, a pak odvolat změny, které byly v odkladu původně.

source: In such a case you could try to extract a text from your file with the `strings` program.
cs: V takovém případě můžete zkusit získat z vašeho souboru texty programem `strings`.

source: In such cases, you can create a file listing patterns to match them named `.gitignore`.
cs: V takových případech můžete vytvořit soubor `.gitignore` se seznamem masek pro ignorované soubory.

source: In that case you must get the Git source code, which you can download from git.kernel.org:
cs: V takovém případě budete muset získat zdrojový text systému Git, který můžete stáhnout ze serveru git.kernel.org:

source: In that case, the `git am` process will fail and ask you what you want to do:
cs: V takovém případě proces `git am` neproběhne a Git se vás zeptá, co chcete udělat dál:

source: In that case, you start the command with a `!` character.
cs: V takovém případě zadejte na začátek příkazu znak `!`.

source: In the Git source code, for example, the maintainer has added their GPG public key as a blob object and then tagged it.
cs: Ve zdrojovém kódu systému Git správce například vložil svůj veřejný klíč GPG jako objekt blobu a ten označil značkou.

source: In the `.gitattributes` file, you can set a filter for particular paths and then set up scripts that will process files just before they’re checked out ("smudge", see Figure 7-2) and just before they’re committed ("clean", see Figure 7-3).
cs: V souboru `.gitattributes` můžete určit filtr pro konkrétní umístění a nastavit skripty, jimiž budou zpracovány soubory těsně před jejich zapsáním („clean“ – viz obrázek 7-2) a těsně před checkoutem („smudge“ – viz obrázek 7-3).

source: In the context of the `diff` command, you can put three periods after another branch to do a `diff` between the last commit of the branch you’re on and its common ancestor with another branch:
cs: V kontextu příkazu `diff` můžete vložit tři tečky za druhou větev – získáte výpis `diff` mezi poslední revizí větve, na níž se nacházíte, a společným předkem s druhou větví:

source: In the current project, this directory contains no files, but it does contain a simple structure:
cs: V aktuálním projektu nejsou v tomto adresáři žádné soubory, zatím tu najdete jen jednoduchou strukturu:

source: In the default case that is automatically written by a `git remote add` command, Git fetches all the references under `refs/heads/` on the server and writes them to `refs/remotes/origin/` locally.
cs: Ve výchozím případě, který se automaticky zapisuje příkazem `git remote add`, Git vyzvedne všechny reference z adresáře `refs/heads/` na serveru a zapíše je do lokálního adresáře `refs/remotes/origin/`.

source: In the early days of Git (mostly pre 1.5), the user interface was much more complex because it emphasized this filesystem rather than a polished VCS.
cs: V dávných dobách (zhruba do verze 1.5) bývalo uživatelské rozhraní systému Git podstatně složitější než dnes. Git tehdy spíš než na uhlazené VCS kladl důraz právě na systém souborů.

source: In the examples below, we will use the `git` account on a host called `gitserver`.
cs: V příkladech uvedených níže budeme používat účet `git` na serveru `gitserver`.

source: In the following example, interns can only push the "int" branch.
cs: Skupina interns může v následujícím případě odesílat pouze větev „int“.

source: In the following examples, and throughout most of this book, for the sake of brevity I don’t format messages nicely like this; instead, I use the `-m` option to `git commit`.
cs: Já v následujících příkladech stejně jako ve většině případů v této knize v rámci zestručnění neformátuji zprávy podle uvedených zásad, naopak používám parametr `-m` za příkazem `git commit`.

source: In the last example output, the unstaged area looks like this:
cs: U posledního příkladu vypadá oblast připravených změn takto:

source: In the last few years, the UI has been refined until it’s as clean and easy to use as any system out there; but often, the stereotype lingers about the early Git UI that was complex and difficult to learn.
cs: Uživatelské rozhraní však bylo za několik posledních let zkultivováno a dnes je už stejně čisté a uživatelsky příjemné jako u ostatních systémů. Přesto přetrvávají předsudky z raných dob a uživatelské rozhraní systému Git se považuje za složité a náročné na pochopení.

source: In the last section of this chapter, I’ll demonstrate using this hook to check that your commit message is conformant to a required pattern.
cs: V poslední části této kapitoly ukážeme, jak lze pomocí tohoto zásuvného modulu zkontrolovat, že zpráva k revizi odpovídá požadovanému vzoru.

source: In the meantime, Jessica has been working on a topic branch.
cs: Jessica mezitím pracovala na tematické větvi.

source: In the next chapter, you’ll learn more powerful tools and tips for dealing with complex situations, which will truly make you a Git master.
cs: V další kapitole poznáte další výkonné nástroje a tipy k řešení složitých situací, které z vás udělají opravdového mistra mezi uživateli systému Git.

source: In the next few sections, you’ll see how to expand to more sophisticated setups.
cs: V dalších částech se podíváme na některé pokročilé možnosti nastavení.

source: In the simplest terms, a bare repository is the contents of your project’s `.git` directory and nothing else.
cs: Jednoduše bychom mohli také říct, že holý repozitář je obsah adresáře `.git` vašeho projektu a nic víc.

source: In this `fast-import` directory, you should find an executable Python script named `git-p4`.
cs: V adresáři `fast-import` byste měli najít spustitelný skript napsaný v jazyce Python pojmenovaný `git-p4`.

source: In this case, Git does a simple three-way merge, using the two snapshots pointed to by the branch tips and the common ancestor of the two.
cs: Git v tomto případě provádí jednoduché třícestné sloučení: vychází ze dvou snímků, na které ukazují větve, a jejich společného předka.

source: In this case, Git uses the last value for each unique key it sees.
cs: V takovém případě použije Git poslední hodnotu pro každý unikátní klíč, který vidí.

source: In this case, I was trying to apply a patch I had already applied.
cs: V tomto případě jsem se pokoušel aplikovat záplatu, kterou už jsem jednou aplikoval.

source: In this case, choose `1c002dd....` If you `git show` that commit, the following commands are equivalent (assuming the shorter versions are unambiguous):
cs: V tomto případě vyberte `1c002dd....`. Pokud chcete na revizi použít příkaz `git show`, budou všechny následující příkazy ekvivalentní (za předpokladu, že jsou zkrácené verze jednoznačné):

source: In this case, database.xml stays at whatever version you originally had.
cs: V tomto případě zůstane soubor database.xml ve své původní podobě.

source: In this case, it’s `http://github.com/testinguser/iphone_project`.
cs: V tomto případě je adresa `http://github.com/testinguser/iphone_project`.

source: In this case, the master branch pull was rejected because it wasn’t a fast-forward reference.
cs: V tomto případě bylo odeslání hlavní větve odmítnuto, protože reference nesměřovala „rychle vpřed“.

source: In this case, the company is using a type of integration-manager workflow where the work of the individual groups is integrated only by certain engineers, and the `master` branch of the main repo can be updated only by those engineers.
cs: Společnost v tomto případě používá typ pracovního postupu s integračním manažerem, kdy práci jednotlivých skupin integrují pouze někteří technici a větev `master` hlavního repozitáře mohou aktualizovat pouze oni.

source: In this case, the last time you ran `git status`, you saw that everything was staged, so you’re ready to commit your changes.
cs: Když jste v našem případě naposledy spustili příkaz `git status`, viděli jste, že všechny soubory byly připraveny k zapsání. Takže jste připraveni k samotnému zapsání změn.

source: In this case, to keep the example simple, you’ll only enforce the `avail` directives.
cs: Abychom příklad nekomplikovali, budete vyžadovat pouze direktivy `avail` (využít).

source: In this case, two stashes were done previously, so you have access to three different stashed works.
cs: V tomto případě byly už dříve provedeny dva další odklady, a máte tak k dispozici tři různé odklady.

source: In this case, typing `git co` and then pressing the Tab key twice suggests commit and config. Adding `m<tab>` completes `git commit` automatically.
cs: Pokud napíšete `git co` a dvakrát stisknete klávesu Tab, systém vám navrhne „commit“ a „config“. Pokud přidáte `m<tab>`, příkaz se automaticky dokončí jako `git commit`.
